<template>
  <nuxt-layout>
    <nuxt-page/>
  </nuxt-layout>
</template>

<script setup>
const appConfig = useAppConfig()

const route = useRoute()

const locale = computed(() => {
  if (route.fullPath.includes('kz')) return 'kz'
  return 'ru'
})

watch(() => locale.value, () => {
  setHead()
})

const setHead = () => {
  useHead({
    ...appConfig,
    title: locale.value === 'kz' ?
        "ҰБТ Байқау Сынағы, Тегін пробный тест 2024, Жаңа формат, Қатемен жұмыс & Пәндік тест."
        :
        "ЕНТ Пробные Тесты, ЕНТ 2024, Новый формат, Предметный тест и Работа с ошибками.",
    meta: [
      {
        hid: 'description',
        name: 'description',
        content: locale.value === 'kz' ?
            'ҰБТ тегін пробный тест. Біздің сайт әртүрлі пәндер мен тақырыптар бойынша тесттер ұсынады. ҰБТ-ға дайындық деңгейінді онлайн тексер. Апта сайын Рейтингтік тесттер.'
            :
            "Подготовьтесь к экзаменам с помощью пробных тестов. Наш сайт предоставляет широкий выбор тестов по различным предметам и темам. Практикуйтесь онлайн перед реальным экзаменом."
      },
      {
        hid: 'keywords',
        name: 'keywords',
        content: locale.value === 'kz' ?
            'Байқау сынағы, тегін тесттер, ҰБТ 2024, онлайн тесттер, жаңа формат, тегін тесттер, қатемен жұмыс, пәндік тест, математика, физика, химия, информатика, биология, тарих, аққ.'
            :
            "Пробные тесты, подготовка к экзаменам, онлайн ент, новый формат, предметный тест, работа с ошибками, тесты по математике, информатика, физика, химия, биология, история."
      },
    ],
  });
}

setHead()

</script>
